package operators;
/**
 * @author dbavc
 * Задание 4: Напишите программу, которая вычисляет скорость для постоянных значений расстояния и времени.
 */
public class Main4 {
	public static void main (String []args) {
		final float s;
		final float t;
		float a;
		t = 15;
		s = 100;
		a = s / t;
		System.out.println("Velocity = " + a);
		}
		
	}
